Revit 2026 API
Document.NewFlexPipe Method
Overload List
Name | Description
NewFlexPipe(IList<XYZ>, FlexPipeType)
NewFlexPipe(Connector, Connector, FlexPipeType) | Adds a new flexible pipe into the document, using two connector, and flexible pipe type.
NewFlexPipe(Connector, IList<XYZ>, FlexPipeType)
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace